//****************************************************************
//****************************************************************
/*
Задание по программированию: Наибольший общий делитель
В stdin даны два натуральных числа. Найти их наибольший общий делитель.

Пример
stdin		stdout
25 27		1
12 16		4
13 13		13
*/
//****************************************************************
//****************************************************************

#include <iostream>
using namespace std;

int gcd(int a, int b) {
	return b ? gcd(b, a % b) : a;
}

int main() {

	int a = 0;
	cin >> a;

	int b = 0;
	cin >> b;

	cout << gcd(a, b) << endl;

	return 0;
}
