//****************************************************************
//****************************************************************
/*
Тренировочное задание по программированию: Деление
На вход дано натуральное число N. Выведите его в двоичной системе счисления 
без ведущих нулей.

Пример
stdin		stdout
5			101
32			100000
1			1
375			101110111
10			1010
Подсказка
число N можно считывать в переменную типа int
в этой задаче вам может пригодиться контейнер vector; напоминаем, 
что добавление значения x в конец вектора v делается так: v.push_back(x);
*/
//****************************************************************
//****************************************************************

//******************First***************************************
#include <iostream>
#include <vector>
using namespace std;

int main() {

	int n = 0;
	cin >> n;

	vector<int> bin;

	while (n > 0) {
		bin.push_back(n % 2);
		n /= 2;
	}
	
	reverse(bin.begin(), bin.end());
	
	for (auto i : bin) {
		cout << i;
	}

	return 0;
}
